## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| update   | `aws_wafv2_web_acl.idp`                                             |
| recreate | `module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this` |
| add      | `aws_appautoscaling_policy.user_portal_cpu[0]`                      |
|          | `aws_appautoscaling_policy.user_portal_memory[0]`                   |
|          | `aws_appautoscaling_target.user_portal[0]`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.user_portal_cpu[0] will be created
  + resource "aws_appautoscaling_policy" "user_portal_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "user_portal_cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/auth/user_portal"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 25

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.user_portal_memory[0] will be created
  + resource "aws_appautoscaling_policy" "user_portal_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "user_portal_memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/auth/user_portal"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 25

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.user_portal[0] will be created
  + resource "aws_appautoscaling_target" "user_portal" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + region             = "ca-central-1"
      + resource_id        = "service/auth/user_portal"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + suspended_state (known after apply)
    }

  # aws_wafv2_web_acl.idp will be updated in-place
  ~ resource "aws_wafv2_web_acl" "idp" {
        id                          = "bab5476e-86d5-4718-aa69-55b379a8673d"
        name                        = "idp"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      - rule {
          - name     = "BlockLargeRequests" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - or_statement {
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - cookies {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_cookies = [] -> null
                                      - included_cookies = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - headers {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_headers = [] -> null
                                      - included_headers = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "BlockLargeRequests" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "BlockLargeRequests"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + or_statement {
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + cookies {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_cookies = []
                                      + included_cookies = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + headers {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_headers = []
                                      + included_headers = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockLargeRequests"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this must be replaced
-/+ resource "aws_codepipeline_webhook" "this" {
      ~ arn             = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
      ~ id              = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
        name            = "github-webhook-idp_user_portal"
      - tags            = {} -> null
      ~ url             = "https://ca-central-1.webhooks.aws/trigger?t=eyJlbmNyeXB0ZWREYXRhIjoiZWowcVl4ajFqYzlya0V2bXRqOU1VK2lRR3N3NlNhems4REVyY2VuTWVlWVNiaWdGRXg2RVVSdzZZVCtEZ1M3RWFneEQzTnMzbUZaSVk5K0l0UHF6NmpFeEcxNDdaUVQxMXF3STd4cVU5KytKaVpheDlFRmE4NkdVMnIzYTFxS0lUZU1jRFRQM1paRWpyQUFyK2lUVVl6cGR6d3lnY0ZYU3ErREFEZTFDYk5pam9RPT0iLCJpdlBhcmFtZXRlclNwZWMiOiJpKzR6ZlRNYi9PSnBoTGp5IiwibWF0ZXJpYWxTZXRTZXJpYWwiOjF9&v=1" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ authentication_configuration {
          ~ secret_token     = (sensitive value) # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 2 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
